# Generative AI for Querying Databases

In [1]:
import sqlite3 as sq3

In [2]:
%load_ext sql

Create/connecct database namely "heart_disease"

In [3]:
%sql sqlite:///heart_disease.db

Create table namely heart_disease

In [4]:
%%sql
CREATE TABLE heart_disease (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    age INTEGER,                 -- Age in years
    gender INTEGER,              -- Gender (1 = male; 0 = female)
    cp INTEGER,                  -- Chest pain type (1 = typical angina; 2 = atypical angina; 3 = non-anginal pain; 4 = asymptomatic)
    trestbps INTEGER,            -- Resting blood pressure in mm Hg
    chol INTEGER,                -- Serum cholesterol in mg/dl
    fbs INTEGER,                 -- Fasting blood sugar > 120 mg/dl (1 = true; 0 = false)
    restecg INTEGER,             -- Resting electrocardiographic results (0 = normal; 1 = ST-T wave abnormality; 2 = probable/definite left ventricular hypertrophy)
    thalach INTEGER,             -- Maximum heart rate achieved
    exang INTEGER,               -- Exercise-induced angina (1 = yes; 0 = no)
    oldpeak REAL,                -- ST depression induced by exercise relative to rest
    slope INTEGER,               -- Slope of the peak exercise ST segment (1 = upsloping; 2 = flat; 3 = downsloping)
    ca INTEGER,                  -- Number of major vessels (0-3) colored by fluoroscopy
    thal INTEGER,                -- Thalassemia (3 = normal; 6 = fixed defect; 7 = reversible defect)
    num INTEGER                  -- Diagnosis of heart disease (0 = < 50% diameter narrowing; 1 = > 50% diameter narrowing)             
);

 * sqlite:///heart_disease.db
Done.

[]

Insert values into table

In [5]:
%%sql
INSERT INTO heart_disease (age, gender, cp, trestbps, chol, fbs, restecg, thalach, exang, oldpeak, slope, ca, thal, num)
VALUES 
(54, 1, 2, 130, 250, 0, 1, 140, 0, 1.2, 2, 0, 3, 1),
(63, 0, 3, 145, 236, 1, 0, 150, 1, 2.3, 3, 1, 6, 1),
(41, 1, 1, 130, 204, 0, 0, 170, 0, 1.4, 1, 2, 7, 0),
(67, 0, 4, 160, 321, 1, 2, 125, 1, 3.1, 2, 1, 6, 1),
(52, 1, 2, 118, 221, 0, 1, 142, 0, 0.8, 2, 3, 3, 0),
(45, 1, 3, 132, 225, 0, 1, 156, 0, 1.5, 3, 0, 7, 1),
(53, 0, 1, 142, 265, 0, 0, 140, 1, 2.6, 2, 0, 3, 0),
(60, 1, 4, 130, 248, 1, 1, 132, 1, 3.0, 3, 2, 6, 1),
(50, 1, 2, 138, 215, 0, 0, 160, 0, 0.5, 1, 0, 7, 0),
(38, 0, 3, 120, 184, 0, 1, 155, 0, 1.0, 2, 0, 3, 0);

 * sqlite:///heart_disease.db
10 rows affected.

[]

In [9]:
%sql select * from heart_disease;

 * sqlite:///heart_disease.db
Done.

[(1, 54, 1, 2, 130, 250, 0, 1, 140, 0, 1.2, 2, 0, 3, 1),
 (2, 63, 0, 3, 145, 236, 1, 0, 150, 1, 2.3, 3, 1, 6, 1),
 (3, 41, 1, 1, 130, 204, 0, 0, 170, 0, 1.4, 1, 2, 7, 0),
 (4, 67, 0, 4, 160, 321, 1, 2, 125, 1, 3.1, 2, 1, 6, 1),
 (5, 52, 1, 2, 118, 221, 0, 1, 142, 0, 0.8, 2, 3, 3, 0),
 (6, 45, 1, 3, 132, 225, 0, 1, 156, 0, 1.5, 3, 0, 7, 1),
 (7, 53, 0, 1, 142, 265, 0, 0, 140, 1, 2.6, 2, 0, 3, 0),
 (8, 60, 1, 4, 130, 248, 1, 1, 132, 1, 3.0, 3, 2, 6, 1),
 (9, 50, 1, 2, 138, 215, 0, 0, 160, 0, 0.5, 1, 0, 7, 0),
 (10, 38, 0, 3, 120, 184, 0, 1, 155, 0, 1.0, 2, 0, 3, 0)]

### Age Distribution
**AI Q1:** Write an SQL query to find the minimum, maximum, and average age of patients in the dataset.  

**Result**  
Certainly! Here is the SQL query to find the minimum, maximum, and average age of patients in the dataset:

```sql
SELECT 
    MIN(age) AS min_age,
    MAX(age) AS max_age,
    AVG(age) AS avg_age
FROM 
    heart_disease;
```

This query will calculate the minimum, maximum, and average age of patients from the "heart_disease_prediction_dataset" table. You can run this query in your SQL database management system to retrieve the desired information.

In [6]:
%%sql
select 
    min(age) as min_page, 
    max(age) as max_age, 
    avg(age) as avg_age 
from heart_disease;

 * sqlite:///heart_disease.db
Done.

[(38, 67, 52.3)]

### Gender Analysis
**AI Q2:** Write and SQL query to count the number of male and female patients in the dataset.

**Result**  
Certainly! Here is the SQL query to count the number of male and female patients in the dataset:

```sql
SELECT 
    gender,
    COUNT(*) AS patient_count
FROM 
    heart_disease
GROUP BY 
    gender;
```

This query will count the number of male and female patients in the dataset by grouping them based on the gender attribute. You can run this query in your SQL database management system to get the count of male and female patients.

In [7]:
%%sql
select gender, count(*) as patient_count
from heart_disease
group by gender;

 * sqlite:///heart_disease.db
Done.

[(0, 4), (1, 6)]

### Chest Pain Type Frequency
**AI Q3:** Write an SQL query to determine the frequency of each type of chest pain (typical angina, atypical angina, non-anginal pain, asymptomatic) among patients.

**Result**  
Certainly! Here is the SQL query to determine the frequency of each type of chest pain (typical angina, atypical angina, non-anginal pain, asymptomatic) among patients:

```sql
SELECT 
    cp,
    COUNT(*) AS pain_frequency
FROM 
    heart_disease
GROUP BY 
    cp;
```

This query will calculate the frequency of each type of chest pain among patients by grouping them based on the cp (chest pain type) attribute. You can run this query in your SQL database management system to get the count of each type of chest pain.

In [8]:
%%sql
select cp, count(*) as pain_frequency
from heart_disease 
group by cp;

 * sqlite:///heart_disease.db
Done.

[(1, 2), (2, 3), (3, 3), (4, 2)]

### Age Group Analysis and Target Variable
**AI Q4:** Write an SQL query to investigate the distribution of the target variable (presence or absence of heart disease) within different age groups (e.g., 20-30, 30-40, etc.).

**Result**  
Certainly! Here is an SQL query to investigate the distribution of the target variable (presence or absence of heart disease) within different age groups:

```sql
SELECT 
    CASE 
        WHEN age BETWEEN 20 AND 30 THEN '20-30'
        WHEN age BETWEEN 31 AND 40 THEN '31-40'
        WHEN age BETWEEN 41 AND 50 THEN '41-50'
        WHEN age BETWEEN 51 AND 60 THEN '51-60'
        WHEN age BETWEEN 61 AND 70 THEN '61-70'
        ELSE 'Above 70'
    END AS age_group,
    SUM(CASE WHEN num = 1 THEN 1 ELSE 0 END) AS heart_disease_count,
    SUM(CASE WHEN num = 0 THEN 1 ELSE 0 END) AS no_heart_disease_count
FROM 
    heart_disease_prediction_dataset
GROUP BY 
    age_group
ORDER BY 
    age_group;
```

This query categorizes the patients into different age groups and calculates the count of presence and absence of heart disease within each age group. You can run this query in your SQL database management system to analyze the distribution of the target variable across different age groups.

In [10]:
%%sql
select
    case
        when age between 20 and 30 then '20-30'
        when age between 31 and 40 then '31-40'
        when age between 41 and 50 then '41-50'
        when age between 51 and 60 then '51-60'
        when age between 61 and 70 then '61-70'
        else 'Above 70'
    end as age_group,
    sum(case when num = 1 then 1 else 0 end) as heart_disease_count,
    sum(case when num = 0 then 1 else 0 end) as no_heart_disease_count
from 
    heart_disease
group by 
    age_group
order by 
    age_group;

 * sqlite:///heart_disease.db
Done.

[('31-40', 0, 1), ('41-50', 1, 2), ('51-60', 2, 2), ('61-70', 2, 0)]

### P1. Cholesterol Range
**AI P1:** Find the range of cholesterol levels among patients (minimum, maximum).

**Result**  
Certainly! Here is an SQL query to find the range of cholesterol levels among patients (minimum, maximum):

```sql
SELECT 
    MIN(chol) AS min_cholesterol,
    MAX(chol) AS max_cholesterol
FROM 
    heart_disease_prediction_dataset;
```

This query will calculate the minimum and maximum cholesterol levels among patients in the dataset. You can run this query in your SQL database management system to retrieve the range of cholesterol levels.

### P2. Age Range and Gender Analysis
**AI P2:** Determine the age range (youngest and oldest) for male and female patients separately.

**Result**  
Certainly! Here is an SQL query to determine the age range (youngest and oldest) for male and female patients separately:

For Male Patients:
```sql
SELECT 
    'Male' AS gender,
    MIN(age) AS youngest_age,
    MAX(age) AS oldest_age
FROM 
    heart_disease_prediction_dataset
WHERE 
    gender = 1;
```

For Female Patients:
```sql
SELECT 
    'Female' AS gender,
    MIN(age) AS youngest_age,
    MAX(age) AS oldest_age
FROM 
    heart_disease_prediction_dataset
WHERE 
    gender = 0;
```

These queries will calculate the youngest and oldest age for male and female patients separately in the dataset. You can run these queries in your SQL database management system to determine the age range for male and female patients.

### P3. Age Group Analysis and Target Variable
**AI P3:** Investigate the distribution of the target variable (presence or absence of heart disease) within different age groups (e.g., 20-30, 30-40, etc.).

**Result**  
Certainly! Here is an SQL query to investigate the distribution of the target variable (presence or absence of heart disease) within different age groups:

```sql
SELECT 
    CASE 
        WHEN age BETWEEN 20 AND 30 THEN '20-30'
        WHEN age BETWEEN 31 AND 40 THEN '31-40'
        WHEN age BETWEEN 41 AND 50 THEN '41-50'
        WHEN age BETWEEN 51 AND 60 THEN '51-60'
        WHEN age BETWEEN 61 AND 70 THEN '61-70'
        ELSE 'Above 70'
    END AS age_group,
    SUM(CASE WHEN num = 1 THEN 1 ELSE 0 END) AS heart_disease_count,
    SUM(CASE WHEN num = 0 THEN 1 ELSE 0 END) AS no_heart_disease_count
FROM 
    heart_disease_prediction_dataset
GROUP BY 
    age_group
ORDER BY 
    age_group;
```

This query categorizes the patients into different age groups and calculates the count of presence and absence of heart disease within each age group. You can run this query in your SQL database management system to analyze the distribution of the target variable across different age groups.

### P4. Maximum Heart Rate by Age Group
**AI P4:** Find the maximum heart rate achieved during exercise for different age groups (e.g., 30-40, 40-50, etc.).

**Result**  
Certainly! Here is an SQL query to find the maximum heart rate achieved during exercise for different age groups:

```sql
SELECT 
    CASE 
        WHEN age BETWEEN 20 AND 30 THEN '20-30'
        WHEN age BETWEEN 31 AND 40 THEN '31-40'
        WHEN age BETWEEN 41 AND 50 THEN '41-50'
        WHEN age BETWEEN 51 AND 60 THEN '51-60'
        WHEN age BETWEEN 61 AND 70 THEN '61-70'
        ELSE 'Above 70'
    END AS age_group,
    MAX(thalach) AS max_heart_rate
FROM 
    heart_disease_prediction_dataset
GROUP BY 
    age_group
ORDER BY 
    age_group;
```

This query groups the patients into different age groups and calculates the maximum heart rate achieved during exercise for each age group. You can run this query in your SQL database management system to find the maximum heart rate achieved by patients in different age ranges.

### P5. Maximum Heart Rate by Age Group
**AI P5:** Calculate the percentage of patients with fasting blood sugar greater than 120 mg/dl.

**Result**  
Certainly! Here is an SQL query to calculate the percentage of patients with fasting blood sugar greater than 120 mg/dl:

```sql
SELECT 
    (COUNT(*) * 100.0 / (SELECT COUNT(*) FROM heart_disease_prediction_dataset)) AS percentage_high_fbs
FROM 
    heart_disease_prediction_dataset
WHERE 
    fbs = 1;
```

This query will calculate the percentage of patients with fasting blood sugar greater than 120 mg/dl in the dataset. You can run this query in your SQL database management system to determine the percentage of patients with high fasting blood sugar levels.

### P6. Ratio of Patients with Resting Electrocardiographic Abnormality
**AI P6:** Find the ratio of patients with abnormal resting electrocardiographic results to those with normal results.

**Result**  
Certainly! Here is an SQL query to find the ratio of patients with abnormal resting electrocardiographic results to those with normal results:

```sql
SELECT 
    SUM(CASE WHEN restecg > 0 THEN 1 ELSE 0 END) AS abnormal_results_count,
    SUM(CASE WHEN restecg = 0 THEN 1 ELSE 0 END) AS normal_results_count,
    (SUM(CASE WHEN restecg > 0 THEN 1 ELSE 0 END) * 1.0 / SUM(CASE WHEN restecg = 0 THEN 1 ELSE 0 END)) AS abnormal_to_normal_ratio
FROM 
    heart_disease_prediction_dataset;
```

This query calculates the count of patients with abnormal and normal resting electrocardiographic results and then determines the ratio of patients with abnormal results to those with normal results. You can run this query in your SQL database management system to find the desired ratio.

### P7. Number of Patients with Reversible Thalassemia
**AI P7:** Count the number of patients with reversible thalassemia detected by thallium stress testing.

**Result**  
Certainly! Here is an SQL query to count the number of patients with reversible thalassemia detected by thallium stress testing:

```sql
SELECT 
    COUNT(*) AS reversible_thalassemia_count
FROM 
    heart_disease_prediction_dataset
WHERE 
    thal = 7;
```

This query will count the number of patients with reversible thalassemia (thal = 7) detected by thallium stress testing in the dataset. You can run this query in your SQL database management system to get the count of patients with this condition.

### P8. Average Age of Patients with Chest Pain
**AI P8:** Calculate the average age of patients who experienced chest pain during diagnosis.

**Result**  
Certainly! Here is an SQL query to calculate the average age of patients who experienced chest pain during diagnosis:

```sql
SELECT 
    AVG(age) AS average_age
FROM 
    heart_disease_prediction_dataset
WHERE 
    cp IN (1, 2, 3, 4);
```

This query calculates the average age of patients who experienced chest pain during diagnosis by filtering the data based on the chest pain type (cp). You can run this query in your SQL database management system to determine the average age of patients with chest pain.

### P9. Distribution of Patients by Number of Major Vessels
**AI P9:** Investigate the distribution of patients based on the number of major vessels colored by fluoroscopy (0-3).

**Result**  
Certainly! Here is an SQL query to investigate the distribution of patients based on the number of major vessels colored by fluoroscopy (0-3):

```sql
SELECT 
    ca,
    COUNT(*) AS patients_count
FROM 
    heart_disease_prediction_dataset
GROUP BY 
    ca
ORDER BY 
    ca;
```

This query will group the patients based on the number of major vessels (0-3) colored by fluoroscopy and calculate the count of patients in each group. You can run this query in your SQL database management system to analyze the distribution of patients based on the number of major vessels colored by fluoroscopy.